src/Catalogs/РабочиеМеста.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>РабочиеМеста</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПрофильВхода</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПараметрыРМ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МестоРеализации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МестаРеализации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тип</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыРМ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Станция</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Станции</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИнформационнаяБаза</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИнформационныеБазы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Фирма</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Фирмы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тест</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Enums/ТипыРМ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>ТипыРМ</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Хостес</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Производство</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СтанцияОплаты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КассовоеМестоРесторана</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Автокасса</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СтанцияСканирования</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СтанцияОплатыКМ</Name>
					<Comment>(классный магазин)</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Catalogs/РабочиеМеста/Ext/ManagerModule.bsl
// Получить массив Мониторов повара (pr не используется)
//
Функция ПолучитьСписокМониторовМарок() Экспорт 	
	
	Если ПараметрыСеанса.Версия = 1 Тогда
		Возврат Новый Массив;
	КонецЕсли;	
	
	Запрос = Новый Запрос("ВЫБРАТЬ
		|	РабочиеМеста.Ссылка
		|ИЗ
		|	Справочник.РабочиеМеста КАК РабочиеМеста
		|ГДЕ
		|	РабочиеМеста.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыРМ.Производство)
		|	И НЕ РабочиеМеста.ПометкаУдаления");
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
КонецФункции

// Получить соответствие ГруппаПечати (для монитора марок) к РМ
//
Функция ПолучитьСоответствиеМониторРМ() Экспорт 
	
	СоответствиеМониторРМ = Новый Соответствие;
	
	Если ПараметрыСеанса.Версия = 1 Тогда
		Возврат СоответствиеМониторРМ;
	КонецЕсли;
	
	Запрос = Новый Запрос("
	|ВЫБРАТЬ
	|	РабочиеМеста.Ссылка
	|ИЗ
	|	Справочник.РабочиеМеста КАК РабочиеМеста
	|ГДЕ
	|	РабочиеМеста.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыРМ.Производство)
	|	И НЕ РабочиеМеста.ПометкаУдаления
	|	И РабочиеМеста.ИнформационнаяБаза = &ИнформационнаяБаза");
	
	// выборка РМ монитора марок по текущей информационной базе
	Запрос.УстановитьПараметр("ИнформационнаяБаза", ПараметрыСеанса.ТекущаяИБ);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Количество() > 0 Тогда
		
		Пока Выборка.Следующий() Цикл
			// получить объект справочника РМ
			ОбъектРМ = Выборка.Ссылка.ПолучитьОбъект();
			// получить параметры РМ
			Попытка
				СтруктураПараметровРМ = ЗначениеИзСтрокиВнутр(ОбъектРМ.ПараметрыРМ);
			Исключение
				Продолжить;
			КонецПопытки;
			// Получить список ГруппПечати если есть
			Если СтруктураПараметровРМ.Свойство("МестоПроизводстваТаблица") Тогда
				
				МассивГруппПечати = СтруктураПараметровРМ.МестоПроизводстваТаблица.ВыгрузитьКолонку("МестоПроизводства");
				
				Для Каждого ГруппаПечати из МассивГруппПечати Цикл
					// Определить есть ли группа печати в соответствии
					СписокРМ = СоответствиеМониторРМ.Получить(ГруппаПечати);	
					// Если нет добавляем новое
					Если СписокРМ = Неопределено Тогда
						СписокРМ = Новый СписокЗначений;
						СписокРМ.Добавить(Выборка.Ссылка);
						СоответствиеМониторРМ.Вставить(ГруппаПечати, СписокРМ);	
					// Если есть ГруппаПечати и нет РМ то добавляем	
					ИначеЕсли СписокРМ.НайтиПоЗначению(Выборка.Ссылка) = Неопределено Тогда
						СписокРМ.Добавить(Выборка.Ссылка);
						СоответствиеМониторРМ.Вставить(ГруппаПечати, СписокРМ);
					КонецЕсли;
					
				КонецЦикла;
				
			КонецЕсли; 
			
		КонецЦикла;	
	КонецЕсли;
	
	Возврат СоответствиеМониторРМ;
		
КонецФункции
